<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"89a4cc847d7fac87d645b5612baf982b52903ad135b5af495823f67fa218ef73","plan_job_ref":"Job Create MPE Management terraform plan #52 at https://github.com/AFMPE/mpe_management/actions/runs/7834758144","plan_hash":"147af39c34caf2973c351ec76e441011ec233273dc61b633f690ae7c4a6d9e24","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 14 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.computer_windows will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "computer_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_managed_disk.data_disk["disk1"] will be created
  + resource "azurerm_managed_disk" "data_disk" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 100
      + id                                = (known after apply)
      + location                          = "eastus"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ampe-eus-jmp-prod-dsk-0"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ampe-eus-devsecops-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = {
          + "ResourceName" = "ampe-eus-jmp-prod-dsk-0"
          + "deployedBy"   = "AzureNoOpsTF"
        }
      + tier                              = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_interface.nic[0] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = []
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ampe-eus-jmp-prod-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-devsecops-prod-rg"
      + tags                          = {
          + "ResourceName" = "ampe-eus-jmp-prod-nic"
          + "deployedBy"   = "AzureNoOpsTF"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig-vmnicipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "**************************************************************************************************************************************************************************************************************"
        }
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_interface_security_group_association.nsgassoc[0] will be created
  + resource "azurerm_network_interface_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "******************************************************************************************************************************************************************************"
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_security_rule.nsg_rule["rdp"] will be created
  + resource "azurerm_network_security_rule" "nsg_rule" {
      + access                      = "Allow"
      + description                 = "Inbound_Port_3386"
      + destination_address_prefix  = "10.8.7.64/27"
      + destination_port_range      = "3386"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "rdp"
      + network_security_group_name = "ampe-eus-devsecops-prod-vm-nsg"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "ampe-eus-devsecops-prod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_security_rule.nsg_rule["ssh"] will be created
  + resource "azurerm_network_security_rule" "nsg_rule" {
      + access                      = "Allow"
      + description                 = "Inbound_Port_22"
      + destination_address_prefix  = "10.8.7.64/27"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ssh"
      + network_security_group_name = "ampe-eus-devsecops-prod-vm-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "ampe-eus-devsecops-prod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_virtual_machine_data_disk_attachment.data_disk["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_virtual_machine_extension.omsagentwin[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentwin" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForWindows"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_windows_virtual_machine.win_vm[0] will be created
  + resource "azurerm_windows_virtual_machine" "win_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + enable_automatic_updates                               = false
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-jmp-prod-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-devsecops-prod-rg"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-jmp-pr"
          + "deployedBy"   = "AzureNoOpsTF"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

  # module.mod_bastion_jmp_virtual_machine[0].random_id.uniqueString will be created
  + resource "random_id" "uniqueString" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "org_prefix" = "ampe"
          + "subid"      = "jmp"
        }
    }

  # module.mod_forensic_network.azurerm_network_watcher_flow_log.nwflog["default"] will be updated in-place
  ~ resource "azurerm_network_watcher_flow_log" "nwflog" {
        id                        = "/subscriptions/96320317-c02c-4dd7-9284-272947c7be25/resourceGroups/NetworkWatcherRG/providers/Microsoft.Network/networkWatchers/NetworkWatcher_eastus/flowLogs/network-watcher-flog-log-forensic"
        name                      = "network-watcher-flog-log-forensic"
      ~ storage_account_id        = "****************************************************************************************************************************************************************" -> (known after apply)
        tags                      = {}
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mod_shared_keyvault[0].data.azurerm_private_endpoint_connection.pip[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_endpoint_connection" "pip" {
      + id                         = (known after apply)
      + location                   = (known after apply)
      + name                       = "ampe-eus-shared-keys-kv-private-endpoint"
      + network_interface          = (known after apply)
      + private_service_connection = (known after apply)
      + resource_group_name        = "ampe-eus-devsecops-prod-rg"
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault.keyvault[0] will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "ampe-eus-shared-keys-kv"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "ampe-eus-devsecops-prod-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "deployedBy"  = "AzureNoOpsTF"
          + "environment" = "public"
          + "workload"    = "shared-keys"
        }
      + tenant_id                       = "************************************"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = [
              + "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-devsecops-prod-vnet/subnets/ampe-eus-devsecops-prod-private-endpoints-snet",
            ]
        }
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault_access_policy.admin_policy["b5c0c042-8317-4222-a16e-55377b7ec32f"] will be created
  + resource "azurerm_key_vault_access_policy" "admin_policy" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Purge",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "************************************"
      + secret_permissions      = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id               = "************************************"
    }

  # module.mod_shared_keyvault[0].azurerm_private_dns_a_record.a_rec[0] will be created
  + resource "azurerm_private_dns_a_record" "a_rec" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ampe-eus-shared-keys-kv"
      + records             = (known after apply)
      + resource_group_name = "ampe-eus-devsecops-prod-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.vaultcore.azure.net"
    }

  # module.mod_shared_keyvault[0].azurerm_private_endpoint.pep[0] will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "ampe-eus-shared-keys-kv-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ampe-eus-devsecops-prod-rg"
      + subnet_id                = "*****************************************************************************************************************************************************************************************************************************"
      + tags                     = {
          + "Name"       = "ampe-eus-shared-keys-kv-private-endpoint"
          + "deployedBy" = "AzureNoOpsTF"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "keyvault-privatelink"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.mod_forensic_network.module.mgt_storage_account_spoke.azurerm_storage_account.storage will be created
  + resource "azurerm_storage_account" "storage" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = false
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ampeeusf9ce3c18deprodst"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "*******"
      + resource_group_name                = "ampe-eus-forensic-prod-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "*******"
      + tags                               = {
          + "ResourceName" = "spokestdiaglogsampeeusf9ce3c18deprodst"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "forensic"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 14 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #52](https://github.com/AFMPE/mpe_management/actions/runs/7834758144)